---
kind: method
id: M:Autodesk.Revit.DB.GeometryObject.GetHashCode
source: html/08e8412d-4002-22a5-858d-f55eba1bed34.htm
---
# Autodesk.Revit.DB.GeometryObject.GetHashCode Method

Gets the integer value of the geometry object as hash code

## Syntax (C#)
```csharp
public override int GetHashCode()
```